InformationRegisters/ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Металл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КачествоОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ИнформацияВИП/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Залогодатель = Параметры.Залогодатель;
	ПолучитьПриказы();
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПриказы()

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
	
	РезультатСтавка = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ";
	
	РезультатМеталл = Запрос.Выполнить().Выгрузить();

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
	
	РезультатВставка = Запрос.Выполнить().Выгрузить();

	Если РезультатСтавка.Количество() > 0 Тогда

		Приказ = РезультатСтавка[0].Регистратор;
		ОтмененныйПриказ = РезультатСтавка[0].Регистратор.ОтменяемыйПриказ;

		//+МАН 25.08.25 Изменил
		//Если ЗначениеЗаполнено(ОтмененныйПриказ) Тогда
		Если РезультатСтавка[0].Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			
			//+МАН 25.08.25 Собираем информацию по отмененному приказу
			Отбор = Новый Структура;
			Отбор.Вставить("Залогодатель", Залогодатель);
			Отбор.Вставить("Ставки", Истина);
			
			МНайденныхСтрок = Приказ.ОтменяемыеПриказы.НайтиСтроки(Отбор);
			
			Для каждого СтрМ Из МНайденныхСтрок Цикл
				НомерОтменяемогоПриказа = СтрМ.НомерПриказа;
				ДатаОтменяемогоПриказа = Формат(СтрМ.ДатаДокумента, "ДФ=dd.MM.yyyy");
			КонецЦикла;
			//-МАН

			//ТекстПриказСтавка = "Приказом №" + ОтмененныйПриказ.НомерПриказа + " от " + Формат(ОтмененныйПриказ.Дата, "ДФ=dd.MM.yyyy");
			ТекстПриказСтавка = "Приказом №" + НомерОтменяемогоПриказа + " от " + ДатаОтменяемогоПриказа;
		//-МАН

			ТекстПериодСтавка = "отменены приказом №";
			
			ТекстПриказОтменыСтавка = Приказ.НомерПриказа + " от " + Приказ.Дата;
			
		//+МАН 25.08.25 Изменил
		//ИначеЕсли НЕ ЗначениеЗаполнено(ОтмененныйПриказ) И Приказ.ДатаОкончанияДействияПриказа <= ТекущаяДата()
		ИначеЕсли РезультатСтавка[0].Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И Приказ.ДатаОкончанияДействияПриказа <= ТекущаяДата()
		//-МАН
			И Приказ.ДатаОкончанияДействияПриказа <> Дата(1,1,1)Тогда

			ТекстПриказСтавка = "Приказом №" + Приказ.НомерПриказа + " от " + Формат(Приказ.Дата, "ДФ=dd.MM.yyyy");

			ТекстПериодСтавка = "прекратили действовать " + Приказ.ДатаОкончанияДействияПриказа;
			
			ТекстПриказОтменыСтавка = "";
			
		Иначе

			ТекстПриказСтавка = "Приказом №" + Приказ.НомерПриказа + " от " + Формат(Приказ.Дата, "ДФ=dd.MM.yyyy");

			ТекстПериодСтавка = "действует с "
			+ ?(НачалоДня(Приказ.Дата) = Приказ.ДатаНачалаДействияПриказа, Приказ.Дата, Приказ.ДатаНачалаДействияПриказа)
			//+МАН 25.11.25 Изменил
			//+ " по " + ?(Приказ.ДатаОкончанияДействияПриказа = Дата(1,1,1), "-", Приказ.ДатаОкончанияДействияПриказа);
			+ ?(Приказ.ДатаОкончанияДействияПриказа = Дата(1,1,1), "", " по - " + Приказ.ДатаОкончанияДействияПриказа);
			//-МАН
			
			ТекстПриказОтменыСтавка = "";
			
		КонецЕсли;
	Иначе
		ТекстСтавка = "Условия по % ставкам не установливались.";
		ТекстПриказСтавка = "";
		ТекстПериодСтавка = "";
		ТекстПриказОтменыСтавка = "";
		Элементы.ДекорацияСтавка.Заголовок = ТекстСтавка;
	КонецЕсли;

	Элементы.ДекорацияПриказСтавка.Заголовок = ТекстПриказСтавка; //"Приказ установки № " + Приказ.НомерПриказа + " от " + Приказ.Дата;
	Элементы.ДекорацияСтавкаПериод.Заголовок = ТекстПериодСтавка;
	Элементы.ДекорацияПриказОтменыСтавка.Заголовок = ТекстПриказОтменыСтавка;

	Если РезультатМеталл.Количество() > 0 Тогда
		Приказ = РезультатМеталл[0].Регистратор;
		ОтмененныйПриказ = РезультатМеталл[0].Регистратор.ОтменяемыйПриказ;

		//+МАН 25.08.25 Изменил
		//Если ЗначениеЗаполнено(ОтмененныйПриказ) Тогда
		Если РезультатМеталл[0].Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда

			//+МАН 25.08.25 Собираем информацию по отмененному приказу
			Отбор = Новый Структура;
			Отбор.Вставить("Залогодатель", Залогодатель);
			Отбор.Вставить("Металлы", Истина);
			
			МНайденныхСтрок = Приказ.ОтменяемыеПриказы.НайтиСтроки(Отбор);
			
			Для каждого СтрМ Из МНайденныхСтрок Цикл
				НомерОтменяемогоПриказа = СтрМ.НомерПриказа;
				ДатаОтменяемогоПриказа = Формат(СтрМ.ДатаДокумента, "ДФ=dd.MM.yyyy");
			КонецЦикла;
			//-МАН

			//ТекстПриказМеталл = "Приказом №" + ОтмененныйПриказ.НомерПриказа + " от " + Формат(ОтмененныйПриказ.Дата, "ДФ=dd.MM.yyyy");
			ТекстПриказМеталл = "Приказом №" + НомерОтменяемогоПриказа + " от " + ДатаОтменяемогоПриказа;
		//-МАН

			ТекстПериодМеталл = "отменены приказом №";
			
			ТекстПриказОтменыМеталл = Приказ.НомерПриказа + " от " + Приказ.Дата;
			
		//+МАН 25.08.25 Изменил
		//ИначеЕсли НЕ ЗначениеЗаполнено(ОтмененныйПриказ) И Приказ.ДатаОкончанияДействияПриказа <= ТекущаяДата()
		ИначеЕсли РезультатМеталл[0].Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И Приказ.ДатаОкончанияДействияПриказа <= ТекущаяДата()
		//-МАН
			И Приказ.ДатаОкончанияДействияПриказа <> Дата(1,1,1) Тогда

			ТекстПриказМеталл = "Приказом №" + Приказ.НомерПриказа + " от " + Формат(Приказ.Дата, "ДФ=dd.MM.yyyy");

			ТекстПериодМеталл = "прекратили действовать " + Приказ.ДатаОкончанияДействияПриказа;
			
			ТекстПриказОтменыМеталл = "";
			
		Иначе

			ТекстПриказМеталл = "Приказом №" + Приказ.НомерПриказа + " от " + Формат(Приказ.Дата, "ДФ=dd.MM.yyyy");

			ТекстПериодМеталл = "действует с "
			+ ?(НачалоДня(Приказ.Дата) = Приказ.ДатаНачалаДействияПриказа, Приказ.Дата, Приказ.ДатаНачалаДействияПриказа)
			//+МАН 25.11.25 Изменил
			//+ " по " + ?(Приказ.ДатаОкончанияДействияПриказа = Дата(1,1,1), "-", Приказ.ДатаОкончанияДействияПриказа);
			+ ?(Приказ.ДатаОкончанияДействияПриказа = Дата(1,1,1), "", " по - " + Приказ.ДатаОкончанияДействияПриказа);
			//-МАН
			
			ТекстПриказОтменыМеталл = "";
			
		КонецЕсли;
	Иначе
		ТекстМеталл = "Условия по оценке металлов не установливались.";
		ТекстПриказМеталл = "";
		ТекстПериодМеталл = "";
		ТекстПриказОтменыМеталл = "";
		Элементы.ДекорацияМеталл.Заголовок = ТекстМеталл;
	КонецЕсли;

	Элементы.ДекорацияПриказМеталл.Заголовок = ТекстПриказМеталл; //"Приказ № " + Приказ.НомерПриказа + " от " + Приказ.Дата;
	Элементы.ДекорацияМеталлПериод.Заголовок = ТекстПериодМеталл;
	Элементы.ДекорацияПриказОтменыМеталл.Заголовок = ТекстПриказОтменыМеталл;

	Если РезультатВставка.Количество() > 0 Тогда
		Приказ = РезультатВставка[0].Регистратор;
		ОтмененныйПриказ = РезультатВставка[0].Регистратор.ОтменяемыйПриказ;

		//+МАН 25.08.25 Изменил
		//Если ЗначениеЗаполнено(ОтмененныйПриказ) Тогда
		Если РезультатВставка[0].Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда

			//+МАН 25.08.25 Собираем информацию по отмененному приказу
			Отбор = Новый Структура;
			Отбор.Вставить("Залогодатель", Залогодатель);
			Отбор.Вставить("Вставки", Истина);
			
			МНайденныхСтрок = Приказ.ОтменяемыеПриказы.НайтиСтроки(Отбор);
			
			Для каждого СтрМ Из МНайденныхСтрок Цикл
				НомерОтменяемогоПриказа = СтрМ.НомерПриказа;
				ДатаОтменяемогоПриказа = Формат(СтрМ.ДатаДокумента, "ДФ=dd.MM.yyyy");
			КонецЦикла;
			//-МАН

			//ТекстПриказВставка = "Приказом №" + ОтмененныйПриказ.НомерПриказа + " от " + Формат(ОтмененныйПриказ.Дата, "ДФ=dd.MM.yyyy");
			ТекстПриказВставка = "Приказом №" + НомерОтменяемогоПриказа + " от " + ДатаОтменяемогоПриказа;
		//-МАН

			ТекстПериодВставка = "отменены приказом №";
			
			ТекстПриказОтменыВставка = Приказ.НомерПриказа + " от " + Приказ.Дата;
			
		//+МАН 25.08.25 Изменил
		//ИначеЕсли НЕ ЗначениеЗаполнено(ОтмененныйПриказ) И Приказ.ДатаОкончанияДействияПриказа <= ТекущаяДата()
		ИначеЕсли РезультатВставка[0].Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И Приказ.ДатаОкончанияДействияПриказа <= ТекущаяДата()
		//-МАН
			И Приказ.ДатаОкончанияДействияПриказа <> Дата(1,1,1)Тогда

			ТекстПриказВставка = "Приказом №" + Приказ.НомерПриказа + " от " + Формат(Приказ.Дата, "ДФ=dd.MM.yyyy");

			ТекстПериодВставка = "прекратили действовать " + Приказ.ДатаОкончанияДействияПриказа;
			
			ТекстПриказОтменыВставка = "";
			
		Иначе

			ТекстПриказВставка = "Приказом №" + Приказ.НомерПриказа + " от " + Формат(Приказ.Дата, "ДФ=dd.MM.yyyy");

			ТекстПериодВставка = "действует с "
			+ ?(НачалоДня(Приказ.Дата) = Приказ.ДатаНачалаДействияПриказа, Приказ.Дата, Приказ.ДатаНачалаДействияПриказа)
			//+МАН 25.11.25 Изменил
			//+ " по " + ?(Приказ.ДатаОкончанияДействияПриказа = Дата(1,1,1), "-", Приказ.ДатаОкончанияДействияПриказа);
			+ ?(Приказ.ДатаОкончанияДействияПриказа = Дата(1,1,1), "", " по - " + Приказ.ДатаОкончанияДействияПриказа);
			//-МАН
			
			ТекстПриказОтменыВставка = "";
			
		КонецЕсли;
	Иначе
		ТекстВставка = "Условия по оценке вставок не установливались.";
		ТекстПриказВставка = "";
		ТекстПериодВставка = "";
		ТекстПриказОтменыВставка = "";
		Элементы.ДекорацияВставка.Заголовок = ТекстВставка;
	КонецЕсли;

	Элементы.ДекорацияПриказВставка.Заголовок = ТекстПриказВставка; //"Приказ № " + Приказ.НомерПриказа + " от " + Приказ.Дата;
	Элементы.ДекорацияВставкаПериод.Заголовок = ТекстПериодВставка;
	Элементы.ДекорацияПриказОтменыВставка.Заголовок = ТекстПриказОтменыВставка;
	
КонецПроцедуры

&НаСервере
Функция НайтиАктивныйПриказ(Залогодатель, Дата, Ставки = Ложь, Металлы = Ложь, Вставки = Ложь)
	
	СтруктураВозврата = Новый Структура("Приказ");

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Если Ставки Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|	И ВЫБОР
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|				ГДЕ
		|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			СтруктураВозврата.Приказ = Результат.Регистратор;
		КонецЕсли;
		
	ИначеЕсли Металлы Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|	И ВЫБОР
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|				ГДЕ
		|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			СтруктураВозврата.Приказ = Результат.Регистратор;
		КонецЕсли;
		
	ИначеЕсли Вставки Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|	И ВЫБОР
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|				ГДЕ
		|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			СтруктураВозврата.Приказ = Результат.Регистратор;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимость()
	Если Элементы.ДекорацияПриказСтавка.Заголовок = "" Тогда
		Элементы.ДекорацияПриказСтавка.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияПриказСтавка.Видимость = Истина;
	КонецЕсли;

	Если Элементы.ДекорацияПриказМеталл.Заголовок = "" Тогда
		Элементы.ДекорацияПриказМеталл.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияПриказМеталл.Видимость = Истина;
	КонецЕсли;

	Если Элементы.ДекорацияПриказВставка.Заголовок = "" Тогда
		Элементы.ДекорацияПриказВставка.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияПриказВставка.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриказСтавкаНажатие(Элемент)
	ОткрытьФормуПриказов(ПриказСтавка);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриказМеталлНажатие(Элемент)
	ОткрытьФормуПриказов(ПриказМеталл);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриказВставкаНажатие(Элемент)
	ОткрытьФормуПриказов(ПриказВставка);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПриказов(Приказ);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Документ", Приказ);
	
	ФормаЗ = ПолучитьФорму("ОбщаяФорма.ЛБ_ЖурналПриказовПоЗалогодателям", ПараметрыФормы,, Новый УникальныйИдентификатор());
	ФормаЗ.Открыть();
КонецПроцедуры
